Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/СтудентыОО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СвойстваСтудентаСтруктура(Пользователь) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("Курс");	
	МассивСвойств.Добавить("УчебнаяГруппа");
	МассивСвойств.Добавить("Статус");
	МассивСвойств.Добавить("Специализация");
	МассивСвойств.Добавить("Специальность");
	МассивСвойств.Добавить("ФормаОбучения");
	МассивСвойств.Добавить("Отделение");
	
	МассивНаименований = Новый Массив;
	МассивНаименований.Добавить("Курс");	
	МассивНаименований.Добавить("Учебная группа");
	МассивНаименований.Добавить("Статус");
	МассивНаименований.Добавить("Специализация");
	МассивНаименований.Добавить("Специальность");
	МассивНаименований.Добавить("Форма обучения");
	МассивНаименований.Добавить("Отделение");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Курс  КАК Курс,
		|	СтудентыООСрезПоследних.УчебнаяГруппа  КАК УчебнаяГруппа,
		|	СтудентыООСрезПоследних.Статус  КАК Статус,
		|	СтудентыООСрезПоследних.Специализация  КАК Специализация,
		|	СтудентыООСрезПоследних.Специальность  КАК Специальность,
		|	СтудентыООСрезПоследних.ФормаОбучения  КАК ФормаОбучения,
		|	СтудентыООСрезПоследних.Отделение  КАК Отделение,
		|	СтудентыООСрезПоследних.Курс.Наименование  КАК КурсНаименование,
		|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование  КАК УчебнаяГруппаНаименование,
		|	СтудентыООСрезПоследних.Статус.Наименование  КАК СтатусНаименование,
		|	СтудентыООСрезПоследних.Специализация.Наименование  КАК СпециализацияНаименование,
		|	СтудентыООСрезПоследних.Специальность.Наименование  КАК СпециальностьНаименование,
		|	СтудентыООСрезПоследних.ФормаОбучения.Наименование КАК ФормаОбученияНаименование,
		|	СтудентыООСрезПоследних.Отделение.Наименование КАК ОтделениеНаименование,
		|	СтудентыООСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
 	ВыборкаДетальныеЗаписи.Следующий();
	
	СвойстваСтудента = Новый Структура;
	СвойстваСтудента.Вставить("Период", ВыборкаДетальныеЗаписи.Период);
	СвойстваСтудента.Вставить("Свойства", Новый Массив());
	
	Индекс = 0;
	Для каждого ИмяСвойстваСтудента Из МассивСвойств Цикл
		
		СвойствоСтудента = Новый Структура();		
		СвойствоСтудента.Вставить("Идентификатор", ВыборкаДетальныеЗаписи[ИмяСвойстваСтудента]);
		СвойствоСтудента.Вставить("Значение", ВыборкаДетальныеЗаписи[ИмяСвойстваСтудента + "Наименование"]);
		СвойствоСтудента.Вставить("ИмяСвойства", ИмяСвойстваСтудента);
		СвойствоСтудента.Вставить("Заголовок", МассивНаименований[Индекс]);
		
		СвойстваСтудента.Свойства.Добавить(СвойствоСтудента);	
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат СвойстваСтудента; 
	
КонецФункции

Процедура РазместитьНаФормеДанныеОСтуденте(Форма, Пользователь, ИмяГруппыЭлементов) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.СтудентыОО) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Курс,
		|	СтудентыООСрезПоследних.УчебнаяГруппа,
		|	СтудентыООСрезПоследних.Статус,
		|	СтудентыООСрезПоследних.Специализация,
		|	СтудентыООСрезПоследних.Специальность,
		|	СтудентыООСрезПоследних.ФормаОбучения,
		|	СтудентыООСрезПоследних.Отделение
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
		
	// Добавляем реквизиты формы
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	НовыйРеквизит = Новый РеквизитФормы("Курс",
								   Новый ОписаниеТипов("СправочникСсылка.КурсыОО"),
								   "",
								   НСтр("ru = 'Курс'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("УчебнаяГруппа",
								   Новый ОписаниеТипов("СправочникСсылка.УчебныеГруппыОО"),
								   "",
								   НСтр("ru = 'Учебная группа'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("Статус",
								   Новый ОписаниеТипов("СправочникСсылка.СтатусыСтудентовОО"),
								   "",
								   НСтр("ru = 'Статус'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	
	НовыйРеквизит = Новый РеквизитФормы("Специализация",
								   Новый ОписаниеТипов("СправочникСсылка.СпециализацииОО"),
								   "",
								   НСтр("ru = 'Специализация'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Специальность",
								   Новый ОписаниеТипов("СправочникСсылка.СпециальностиОО"),
								   "",
								   НСтр("ru = 'Специальность'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ФормаОбучения",
								   Новый ОписаниеТипов("СправочникСсылка.ФормыОбученияОО"),
								   "",
								   НСтр("ru = 'Форма обучения'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Отделение",
								   Новый ОписаниеТипов("СправочникСсылка.ОтделенияОО"),
								   "",
								   НСтр("ru = 'Отделение'"),
								   Ложь);
								   
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	
	// Устанавливаем значение реквизитов
	
	Форма["Курс"]          = ВыборкаДетальныеЗаписи.Курс;
	Форма["УчебнаяГруппа"] = ВыборкаДетальныеЗаписи.УчебнаяГруппа;
	Форма["Статус"]        = ВыборкаДетальныеЗаписи.Статус;
	Форма["Специализация"] = ВыборкаДетальныеЗаписи.Специализация;
	Форма["Специальность"] = ВыборкаДетальныеЗаписи.Специальность;
	Форма["ФормаОбучения"] = ВыборкаДетальныеЗаписи.ФормаОбучения;
	Форма["Отделение"]     = ВыборкаДетальныеЗаписи.Отделение;
	
	// Добавляем элементы формы
	
	ЭлементФормы = Форма.Элементы.Добавить("Курс",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Курс'");
	ЭлементФормы.ПутьКДанным    = "Курс";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("УчебнаяГруппа",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Учебная группа'");
	ЭлементФормы.ПутьКДанным    = "УчебнаяГруппа";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Статус",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Статус'");
	ЭлементФормы.ПутьКДанным    = "Статус";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Специализация",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Специализация'");
	ЭлементФормы.ПутьКДанным    = "Специализация";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Специальность",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Специальность'");
	ЭлементФормы.ПутьКДанным    = "Специальность";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("ФормаОбучения",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Форма обучения'");
	ЭлементФормы.ПутьКДанным    = "ФормаОбучения";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	ЭлементФормы = Форма.Элементы.Добавить("Отделение",
									 Тип("ПолеФормы"),
									 Форма.Элементы[ИмяГруппыЭлементов]); 	
					  
	ЭлементФормы.Вид            = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок      = НСтр("ru = 'Отделение'");
	ЭлементФормы.ПутьКДанным    = "Отделение";
	ЭлементФормы.КнопкаОткрытия = Истина;
	ЭлементФормы.ТолькоПросмотр = Истина;
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;

	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") <> Неопределено Тогда
		
		Пользователь = Отбор.Пользователь.Значение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК ПрохождениеОбучения
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.Пользователь = &Пользователь
			|	И ПрохождениеОбученияСУО.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Документы.ПрохождениеОбученияСУО.ПустаяСсылка());
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(ВыборкаДетальныеЗаписи.ПрохождениеОбучения);
			ПараметрыФЗ.Добавить(Неопределено);			
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ИмяТаблицы, "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(ВыборкаДетальныеЗаписи.ПрохождениеОбучения.УникальныйИдентификатор()), 1);

			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(Пользователь);
			ПараметрыФЗ.Добавить(Неопределено);		
		
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета", ПараметрыФЗ, Строка(Пользователь.УникальныйИдентификатор()), 1);
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ВсеСтуденты() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтудентыООСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних КАК СтудентыООСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецОбласти

#КонецЕсли
